src/InformationRegisters/ar_ПредметыАгентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ПредметыАгентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Запуск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Захвачен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПакетИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследняяПричина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СбоевПодряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Исключён</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Отложен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтложенКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтложенОтпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтложенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтложенПричина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнийПульс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Диалог</Name>					<Type>
						<v8:Type>cfg:CatalogRef.ar_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Предмет</Name>					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ar_ПредметыАгентов/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_ПредметыАгентов (agentrunner-32).
//
// Регистр захватов и сбоев по паре «агент + предмет»: захват предмета при
// старте запуска, снятие при финализации, счётчик сбоев подряд, отсев
// кандидатов очереди, уборка сиротских захватов.
//
// Правило захвата (решение человека 2026-10-06): один агент не держит больше
// одного активного запуска на документ; агенты одной очереди (общий
// ar_ПакетИсточник) документ не делят; разные агенты работают с документом
// параллельно.
//
// Вызывается ТОЛЬКО под привилегиями: все записи идут через фасад
// ar_AuditЗащищённыйРежим (как ar_Запуски у ядра) - чтение регистра под
// правами пользователя не гарантировано, роли не выдают право на регистр.
// Сам модуль привилегии не поднимает (AUD-06: Privileged=true в расширениях
// запрещён; баланс Истина/Ложь - на стороне фасада).
//
// Свойства модуля: Сервер, без вызова с клиента, Привилегированный = Ложь.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Захватить предмет за запуском (вызывается под привилегиями фасада).
//
// В транзакции с управляемой исключительной блокировкой регистра читается
// запись пары (агент, предмет):
//  * ar_Запуск заполнен и захват ещё активен (запуск жив, не в финальном
//    статусе или в ожидании автоповтора) - отказ "subject_captured";
//  * для триггеров очереди ("queue"/"deadline_expired") блокировка ставится
//    по одному ar_Предмет (сериализует всех агентов) и дополнительно
//    проверяется захват другим агентом с тем же ar_ПакетИсточник - отказ
//    "subject_captured_by_queue_peer";
//  * иначе запись перезаписывается новым RunId (ar_Захвачен, ar_Триггер,
//    ar_ПакетИсточник); счётчик сбоев и последняя причина снятия при захвате
//    не трогаются.
//
// Параметры:
//  СсылкАгент    - СправочникСсылка.ar_Агенты - захватывающий агент.
//  Предмет       - ЛюбаяСсылка - предмет запуска (справочник/документ).
//  RunId         - Строка(36) - идентификатор нового запуска (сгенерирован
//                  вызывающим кодом до захвата).
//  Триггер       - Строка - триггер запуска ("queue", "manual", ...).
//  ПакетИсточник - Строка - пространство имён очереди агента ("" если нет).
//
// Возвращаемое значение:
//  Структура - {Успех: Булево, Причина: Строка, RunIdДержатель: Строка}.
//  RunIdДержатель заполнен при отказе - RunId активного запуска-держателя.
//
Функция ЗахватитьЗапуском(Знач СсылкАгент, Знач Предмет, Знач RunId, Знач Триггер,
		Знач ПакетИсточник) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Причина", "");
	Результат.Вставить("RunIdДержатель", "");

	ОтказСвой = Ложь;
	ОтказСосед = Ложь;

	НачатьТранзакцию();
	Попытка

		// Для триггеров очереди - по предмету (все агенты), иначе по паре
		// (агент, предмет): ручные и подписочные запуски разных агентов
		// сериализовать не нужно.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_ПредметыАгентов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Если Не ЭтоТриггерОчереди(Триггер) Тогда
			ЭлементБлокировки.УстановитьЗначение("ar_Агент", СсылкАгент);
		КонецЕсли;
		ЭлементБлокировки.УстановитьЗначение("ar_Предмет", Предмет);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_ПредметыАгентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_Агент = СсылкАгент;
		МенеджерЗаписи.ar_Предмет = Предмет;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран() И ЗначениеЗаполнено(МенеджерЗаписи.ar_Запуск)
			И ЗахватАктивен(МенеджерЗаписи.ar_Запуск) Тогда
			ОтказСвой = Истина;
			Результат.RunIdДержатель = СокрЛП(МенеджерЗаписи.ar_Запуск);
		КонецЕсли;

		Если Не ОтказСвой И ЭтоТриггерОчереди(Триггер) И ЗначениеЗаполнено(ПакетИсточник) Тогда
			Результат.RunIdДержатель = ЗахватСоседаПоОчереди(Предмет, СсылкАгент, ПакетИсточник);
			ОтказСосед = Не ПустаяСтрока(Результат.RunIdДержатель);
		КонецЕсли;

		Если Не ОтказСвой И Не ОтказСосед Тогда
			МенеджерЗаписи.ar_Запуск = RunId;
			МенеджерЗаписи.ar_Захвачен = ТекущаяДатаСеанса();
			МенеджерЗаписи.ar_Триггер = Триггер;
			МенеджерЗаписи.ar_ПакетИсточник = ПакетИсточник;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Если ОтказСвой Тогда
		Результат.Причина = "subject_captured";
	ИначеЕсли ОтказСосед Тогда
		Результат.Причина = "subject_captured_by_queue_peer";
	Иначе
		Результат.Успех = Истина;
		ЗафиксироватьЗахватВзят(СсылкАгент, Предмет, RunId, Триггер);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Снять захват записи с ar_Запуск = RunId (одна точка снятия для фасада,
// уборки и консоли; вызывается под привилегиями фасада).
//
// Идемпотентна: запись с таким RunId не найдена (уже снята) - ничего не
// делает, сбой не считает. Захват держится, пока запуск не в финальном
// статусе или ожидает автоповтор (ОшибкаВыполнения с заполненным
// ar_ПовторитьПосле будет возобновлён тем же RunId). Записи запуска нет -
// захват снимается (сбой не считается).
//
// Счётчик сбоев меняется только при фактическом снятии: ОшибкаВыполнения
// (без автоповтора), ОшибкаНесовместимоеСостояние и причина
// "heartbeat_timeout" - +1; Завершён - сброс в 0; прочие причины и статусы
// счётчик не меняют. При достижении порога (3) - ar_Исключён = Истина,
// уведомление администраторам (повод "subject_excluded").
//
// Параметры:
//  RunId         - Строка(36) - идентификатор завершившегося запуска.
//  ПричинаСнятия - Строка - причина из вызывающего кода ("cancelled",
//                  "question_expired", "heartbeat_timeout", "start_failed",
//                  "operator", "orphan"); пусто - вычисляется по статусу.
//
// Возвращаемое значение:
//  Булево - Истина, если захват фактически снят.
//
Функция СнятьЗахватЗапуска(Знач RunId, Знач ПричинаСнятия = "") Экспорт

	ЗаписьЗахвата = ЗаписьЗахватаПоЗапуску(RunId);
	Если ЗаписьЗахвата = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Состояние = СостояниеЗапуска(RunId);
	Если Состояние <> Неопределено Тогда
		Если Не ЭтоФинальныйСтатус(Состояние.Статус) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если ОжиданиеАвтоповтора(Состояние) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Причина = ?(ПустаяСтрока(ПричинаСнятия), ПричинаПоСостоянию(Состояние), ПричинаСнятия);
	СчётчикСбоев = 0;
	УчитыватьСбой = Ложь;
	Исключён = Ложь;

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_ПредметыАгентов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ar_Агент", ЗаписьЗахвата.Агент);
		ЭлементБлокировки.УстановитьЗначение("ar_Предмет", ЗаписьЗахвата.Предмет);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_ПредметыАгентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_Агент = ЗаписьЗахвата.Агент;
		МенеджерЗаписи.ar_Предмет = ЗаписьЗахвата.Предмет;
		МенеджерЗаписи.Прочитать();

		// Проверка под блокировкой: за время между чтением и снятием захват
		// мог быть перезаписан новым запуском того же агента.
		Если МенеджерЗаписи.Выбран() И СокрЛП(МенеджерЗаписи.ar_Запуск) = RunId Тогда
			СчётчикСбоев = МенеджерЗаписи.ar_СбоевПодряд;
			УчитыватьСбой = СбойУчитывается(Состояние, Причина);
			Если УчитыватьСбой Тогда
				СчётчикСбоев = СчётчикСбоев + 1;
			ИначеЕсли Состояние <> Неопределено
				И Состояние.Статус = Перечисления.ar_СтатусЗапуска.Завершён Тогда
				СчётчикСбоев = 0;
			КонецЕсли;
			Исключён = СчётчикСбоев >= ПорогСбоев();

			МенеджерЗаписи.ar_Запуск = "";
			МенеджерЗаписи.ar_ПоследняяПричина = Причина;
			МенеджерЗаписи.ar_СбоевПодряд = СчётчикСбоев;
			МенеджерЗаписи.ar_Исключён = Исключён;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат СнятьЗахватЗавершение(RunId, ЗаписьЗахвата, Состояние, Причина,
		СчётчикСбоев, УчитыватьСбой, Исключён);

КонецФункции

// Сбросить счётчик сбоев предмета оператором (консоль; вызывается под
// привилегиями фасада): ar_СбоевПодряд = 0, ar_Исключён = Ложь. Идемпотентно.
//
// Параметры:
//  СсылкАгент - СправочникСсылка.ar_Агенты.
//  Предмет    - ЛюбаяСсылка.
//
// Возвращаемое значение:
//  Булево - Истина, если счётчик был сброшен (было что сбрасывать).
//
Функция СброситьСбои(Знач СсылкАгент, Знач Предмет) Экспорт

	Сброшено = Ложь;

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_ПредметыАгентов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ar_Агент", СсылкАгент);
		ЭлементБлокировки.УстановитьЗначение("ar_Предмет", Предмет);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_ПредметыАгентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_Агент = СсылкАгент;
		МенеджерЗаписи.ar_Предмет = Предмет;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран()
			И (МенеджерЗаписи.ar_СбоевПодряд > 0 ИЛИ МенеджерЗаписи.ar_Исключён) Тогда
			МенеджерЗаписи.ar_СбоевПодряд = 0;
			МенеджерЗаписи.ar_Исключён = Ложь;
			МенеджерЗаписи.Записать(Истина);
			Сброшено = Истина;
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Если Сброшено Тогда
		ar_СлужебныйЛог.Записать(ИмяМодуляЛога(), "failures_reset",
			СтрШаблон("Оператор=%1; Агент=%2; Предмет=%3",
				Строка(Пользователи.ТекущийПользователь()), Строка(СсылкАгент), Строка(Предмет)),
			"Информация", "", Предмет);
	КонецЕсли;

	Возврат Сброшено;

КонецФункции

// Уборка сиротских захватов (вызывается под привилегиями фасада, из тика
// диспетчера): записи с заполненным ar_Запуск и ar_Захвачен старше окна
// (5 минут - запас на разрыв между захватом и созданием записи запуска),
// где запуск в финальном статусе (не в ожидании автоповтора) или записи
// запуска нет, снимаются с причиной "orphan"; сбой считается по статусу
// запуска теми же правилами (нет записи - не считается).
//
// Параметры:
//  ТекущийМомент - Дата - момент тика (сеансовое время).
//
Процедура УбратьСиротскиеЗахваты(Знач ТекущийМомент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Захваты.ar_Агент КАК Агент,
		|	Захваты.ar_Предмет КАК Предмет,
		|	Захваты.ar_Запуск КАК RunId
		|ИЗ
		|	РегистрСведений.ar_ПредметыАгентов КАК Захваты
		|ГДЕ
		|	Захваты.ar_Запуск <> """"
		|	И Захваты.ar_Захвачен < &Граница";
	Запрос.УстановитьПараметр("Граница", ТекущийМомент - ОкноУборкиСек());

	Кандидаты = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Кандидаты.Добавить(Новый Структура("Агент, Предмет, RunId",
			Выборка.Агент, Выборка.Предмет, СокрЛП(Выборка.RunId)));
	КонецЦикла;

	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Состояния = СостоянияЗапусков(RunIdСписокКандидатов(Кандидаты));

	Для Каждого СтрокаКандидата Из Кандидаты Цикл
		Состояние = Состояния.Получить(СтрокаКандидата.RunId);
		Если Состояние <> Неопределено
			И (Не ЭтоФинальныйСтатус(Состояние.Статус) ИЛИ ОжиданиеАвтоповтора(Состояние)) Тогда
			Продолжить;
		КонецЕсли;
		Если Не ar_AuditЗащищённыйРежим.СнятьЗахватПривилегированно(СтрокаКандидата.RunId, "orphan") Тогда
			Продолжить;
		КонецЕсли;
		ТекстСтатуса = ?(Состояние = Неопределено,
			НСтр("ru='запуск не найден'; en='run not found'"),
			Строка(Состояние.Статус));
		ar_СлужебныйЛог.Записать(ИмяМодуляЛога(), "orphan_capture_cleared",
			СтрШаблон("RunId=%1; Статус=%2", СтрокаКандидата.RunId, ТекстСтатуса),
			"Предупреждение", СтрокаКандидата.RunId, СтрокаКандидата.Предмет);
	КонецЦикла;

КонецПроцедуры

// Данные очереди агента для guard'а запуска и диспетчера.
//
// Параметры:
//  СсылкАгент - СправочникСсылка.ar_Агенты.
//
// Возвращаемое значение:
//  Структура - {ЛимитЗапусков: Число - потолок параллельных запусков агента
//  (реквизит ar_МаксПараллельныхЗапусков, 0/пусто трактуется как 1, но не
//  больше константы SCHED-05 ar_МаксОдновременныхЗапусковАгента);
//  ПакетИсточник: Строка - пространство имён очереди ("" если нет)}.
//
Функция ДанныеОчередиАгента(Знач СсылкАгент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Агенты.ar_МаксПараллельныхЗапусков КАК МаксПараллельныхЗапусков,
		|	Агенты.ar_ПакетИсточник КАК ПакетИсточник
		|ИЗ
		|	Справочник.ar_Агенты КАК Агенты
		|ГДЕ
		|	Агенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкАгент);

	ЛимитЗапусков = 1;
	ПакетИсточник = "";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЛимитЗапусков = ЛимитПараллельных(Выборка.МаксПараллельныхЗапусков);
		ПакетИсточник = СокрЛП(Выборка.ПакетИсточник);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ЛимитЗапусков", ЛимитЗапусков);
	Результат.Вставить("ПакетИсточник", ПакетИсточник);
	Возврат Результат;

КонецФункции

// Отсев кандидатов очереди одним запросом к регистру (вызывается под
// привилегиями фасада, из диспетчера). Предмет отсеивается, если он
// исключён для этого агента, захвачен этим агентом или захвачен соседом по
// очереди (другой агент с тем же ar_ПакетИсточник) активным запуском.
//
// Параметры:
//  СсылкАгент    - СправочникСсылка.ar_Агенты - агент очереди.
//  ПакетИсточник - Строка - пространство имён очереди агента.
//  Предметы      - Массив - ссылки-кандидаты от пакета.
//
// Возвращаемое значение:
//  Структура - {Отсеянные: Соответствие "Предмет -> ПричинаОтсева"
//  ("excluded"/"captured_self"/"captured_queue_peer"); ПоследниеПричины:
//  Соответствие "Предмет -> Строка" - причина последнего снятия по паре
//  (для добавки инструкции deadline_expired)}.
//
Функция ОтсеятьКандидаты(Знач СсылкАгент, Знач ПакетИсточник, Знач Предметы) Экспорт

	Отсеянные = Новый Соответствие;
	ПоследниеПричины = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Захваты.ar_Предмет КАК Предмет,
		|	Захваты.ar_Запуск КАК RunId,
		|	Захваты.ar_Исключён КАК Исключён,
		|	Захваты.ar_ПоследняяПричина КАК ПоследняяПричина,
		|	ИСТИНА КАК ЭтоСвой
		|ИЗ
		|	РегистрСведений.ar_ПредметыАгентов КАК Захваты
		|ГДЕ
		|	Захваты.ar_Агент = &Агент
		|	И Захваты.ar_Предмет В (&Предметы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Захваты.ar_Предмет,
		|	Захваты.ar_Запуск,
		|	ЛОЖЬ,
		|	"",
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.ar_ПредметыАгентов КАК Захваты
		|ГДЕ
		|	Захваты.ar_Агент <> &Агент
		|	И Захваты.ar_ПакетИсточник = &Пакет
		|	И Захваты.ar_Запуск <> """"
		|	И Захваты.ar_Предмет В (&Предметы)";
	Запрос.УстановитьПараметр("Агент", СсылкАгент);
	Запрос.УстановитьПараметр("Пакет", ПакетИсточник);
	Запрос.УстановитьПараметр("Предметы", Предметы);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоСвой Тогда
			ПоследниеПричины.Вставить(Выборка.Предмет, СокрЛП(Выборка.ПоследняяПричина));
			Если Выборка.Исключён Тогда
				Отсеянные.Вставить(Выборка.Предмет, "excluded");
			ИначеЕсли ЗначениеЗаполнено(Выборка.RunId) И ЗахватАктивен(Выборка.RunId) Тогда
				Отсеянные.Вставить(Выборка.Предмет, "captured_self");
			КонецЕсли;
		ИначеЕсли ЗахватАктивен(Выборка.RunId) Тогда
			Отсеянные.Вставить(Выборка.Предмет, "captured_queue_peer");
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("Отсеянные", Отсеянные);
	Результат.Вставить("ПоследниеПричины", ПоследниеПричины);
	Возврат Результат;

КонецФункции

// Таблица захватов для страницы «Захваты и очередь» консоли (вызывается под
// привилегиями фасада).
//
// Параметры:
//  РежимОтбора - Строка - "captured" (только захваченные), "excluded"
//                (только исключённые), иначе все.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Агент, Предмет, Запуск, Захвачен, Триггер, СбоевПодряд,
//  Исключён, ПоследняяПричина.
//
Функция ЗахватыДляКонсоли(Знач РежимОтбора) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Захваты.ar_Агент КАК Агент,
		|	Захваты.ar_Предмет КАК Предмет,
		|	Захваты.ar_Запуск КАК Запуск,
		|	Захваты.ar_Захвачен КАК Захвачен,
		|	Захваты.ar_Триггер КАК Триггер,
		|	Захваты.ar_СбоевПодряд КАК СбоевПодряд,
		|	Захваты.ar_Исключён КАК Исключён,
		|	Захваты.ar_ПоследняяПричина КАК ПоследняяПричина
		|ИЗ
		|	РегистрСведений.ar_ПредметыАгентов КАК Захваты
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ТолькоЗахваченные
		|			ТОГДА Захваты.ar_Запуск <> """"
		|		КОГДА &ТолькоИсключённые
		|			ТОГДА Захваты.ar_Исключён
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|УПОРЯДОЧИТЬ ПО
		|	Захваты.ar_Захвачен УБЫВ";
	Запрос.УстановитьПараметр("ТолькоЗахваченные", РежимОтбора = "captured");
	Запрос.УстановитьПараметр("ТолькоИсключённые", РежимОтбора = "excluded");

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Последний итог тика очереди по агенту из журнала (queue_tick) для консоли
// (вызывается под привилегиями фасада).
//
// Параметры:
//  Агенты - Массив - ссылки ar_Агенты агентов очереди.
//
// Возвращаемое значение:
//  Соответствие - "Агент -> Структура {Момент, Текст}" последней записи
//  queue_tick; агент без записей в соответствии отсутствует.
//
Функция ПоследниеТикиОчереди(Знач Агенты) Экспорт

	Результат = Новый Соответствие;

	Если Агенты.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 200
		|	Лог.ar_Момент КАК Момент,
		|	Лог.ar_ОбъектСсылка КАК ОбъектСсылка,
		|	Лог.ar_Текст КАК Текст
		|ИЗ
		|	РегистрСведений.ar_СлужебныйЛог КАК Лог
		|ГДЕ
		|	Лог.ar_Источник = &Источник
		|	И Лог.ar_Событие = &Событие
		|	И Лог.ar_ОбъектСсылка В (&АгентыСсылки)
		|УПОРЯДОЧИТЬ ПО
		|	Лог.ar_Момент УБЫВ";
	Запрос.УстановитьПараметр("Источник", ИмяИсточникаДиспетчера());
	Запрос.УстановитьПараметр("Событие", "queue_tick");
	Запрос.УстановитьПараметр("АгентыСсылки", НавигационныеСсылкиАгентов(Агенты));

	Найденные = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Найденные.Получить(Выборка.ОбъектСсылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Найденные.Вставить(Выборка.ОбъектСсылка,
			Новый Структура("Момент, Текст", Выборка.Момент, Выборка.Текст));
	КонецЦикла;

	Для Каждого Агент Из Агенты Цикл
		ДанныеТика = Найденные.Получить(ar_Утилиты.НавигационнаяСсылкаОбъекта(Агент));
		Если ДанныеТика <> Неопределено Тогда
			Результат.Вставить(Агент, ДанныеТика);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// История событий механизма по предмету (вызывается под привилегиями
// фасада): записи ar_СлужебныйЛог с ar_ОбъектСсылка = навигационная ссылка
// предмета, по времени убыванию.
//
// Параметры:
//  Предмет - ЛюбаяСсылка.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Момент, Источник, Событие, Уровень, RunId, Текст.
//
Функция ИсторияПоПредмету(Знач Предмет) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	Лог.ar_Момент КАК Момент,
		|	Лог.ar_Источник КАК Источник,
		|	Лог.ar_Событие КАК Событие,
		|	Лог.ar_Уровень КАК Уровень,
		|	Лог.ar_RunId КАК RunId,
		|	Лог.ar_Текст КАК Текст
		|ИЗ
		|	РегистрСведений.ar_СлужебныйЛог КАК Лог
		|ГДЕ
		|	Лог.ar_ОбъектСсылка = &ОбъектСсылка
		|УПОРЯДОЧИТЬ ПО
		|	Лог.ar_Момент УБЫВ";
	Запрос.УстановитьПараметр("ОбъектСсылка", ar_Утилиты.НавигационнаяСсылкаОбъекта(Предмет));

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пост-обработка фактического снятия: журнал, событие запуска, уведомление
// об исключении. Вынесена из СнятьЗахватЗапуска ради её когнитивной
// сложности; вызывается только после фактического снятия.
//
Функция СнятьЗахватЗавершение(Знач RunId, Знач ЗаписьЗахвата, Знач Состояние,
	Знач Причина, Знач СчётчикСбоев, Знач УчитыватьСбой, Знач Исключён)

	СтатусТекст = ?(Состояние = Неопределено, "", Строка(Состояние.Статус));

	ar_СлужебныйЛог.Записать(ИмяМодуляЛога(), "subject_released",
		СтрШаблон("RunId=%1; Статус=%2; Причина=%3; Агент=%4; Предмет=%5",
			RunId, СтатусТекст, Причина,
			Строка(ЗаписьЗахвата.Агент), Строка(ЗаписьЗахвата.Предмет)),
		"Информация", RunId, ЗаписьЗахвата.Предмет);

	Если УчитыватьСбой Тогда
		ar_СлужебныйЛог.Записать(ИмяМодуляЛога(), "failure_counted",
			СтрШаблон("Статус=%1; Причина=%2; СбоевПодряд=%3", СтатусТекст, Причина, СчётчикСбоев),
			"Предупреждение", RunId, ЗаписьЗахвата.Предмет);
	ИначеЕсли Состояние <> Неопределено
		И Состояние.Статус = Перечисления.ar_СтатусЗапуска.Завершён Тогда
		ar_СлужебныйЛог.Записать(ИмяМодуляЛога(), "failures_reset",
			СтрШаблон("completed (RunId=%1)", RunId),
			"Информация", RunId, ЗаписьЗахвата.Предмет);
	КонецЕсли;

	Если Исключён Тогда
		ИсключитьПредмет(RunId, ЗаписьЗахвата, СчётчикСбоев);
	КонецЕсли;

	СобытиеСнятия = Новый Структура;
	СобытиеСнятия.Вставить("reason", Причина);
	СобытиеСнятия.Вставить("status", СтатусТекст);
	ar_AuditСобытия.Зафиксировать(RunId, "ЗахватСнят", СобытиеСнятия);

	Возврат Истина;

КонецФункции

// Исключение предмета из выдачи очереди: журнал subject_excluded с тремя
// последними RunId сбоев и письмо администраторам (повод "subject_excluded").
//
Функция ИсключитьПредмет(Знач RunId, Знач ЗаписьЗахвата, Знач СчётчикСбоев)

	ТекстИсключения = СтрШаблон(
		"Агент=%1; Предмет=%2; Исключён после %3 сбоев подряд; Последние запуски: %4",
		Строка(ЗаписьЗахвата.Агент),
		Строка(ЗаписьЗахвата.Предмет),
		Строка(СчётчикСбоев),
		ПоследниеRunIdСбоев(ЗаписьЗахвата.Предмет));

	ar_СлужебныйЛог.Записать(ИмяМодуляЛога(), "subject_excluded",
		ТекстИсключения, "Ошибка", RunId, ЗаписьЗахвата.Предмет);

	// Best-effort: уведомление само гасит исключения (контракт ar_Уведомления).
	ar_Уведомления.Уведомить(RunId, "subject_excluded");

	Возврат Истина;

КонецФункции

// Три последних RunId сбоев по предмету из журнала (failure_counted) для
// текста subject_excluded и письма администраторам.
//
Функция ПоследниеRunIdСбоев(Знач Предмет)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 3
		|	Лог.ar_RunId КАК RunId
		|ИЗ
		|	РегистрСведений.ar_СлужебныйЛог КАК Лог
		|ГДЕ
		|	Лог.ar_Источник = &Источник
		|	И Лог.ar_Событие = &Событие
		|	И Лог.ar_ОбъектСсылка = &ОбъектСсылка
		|	И Лог.ar_RunId <> """"
		|УПОРЯДОЧИТЬ ПО
		|	Лог.ar_Момент УБЫВ";
	Запрос.УстановитьПараметр("Источник", ИмяМодуляЛога());
	Запрос.УстановитьПараметр("Событие", "failure_counted");
	Запрос.УстановитьПараметр("ОбъектСсылка", ar_Утилиты.НавигационнаяСсылкаОбъекта(Предмет));

	Запуски = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запуски = ?(ПустаяСтрока(Запуски), Выборка.RunId, Запуски + ", " + Выборка.RunId);
	КонецЦикла;

	Возврат ?(ПустаяСтрока(Запуски), "-", Запуски);

КонецФункции

// Зафиксировать успешный захват: журнал subject_captured и событие запуска
// ЗахватВзят (видны в просмотре запуска).
//
Функция ЗафиксироватьЗахватВзят(Знач СсылкАгент, Знач Предмет, Знач RunId, Знач Триггер)

	ar_СлужебныйЛог.Записать(ИмяМодуляЛога(), "subject_captured",
		СтрШаблон("Триггер=%1; Агент=%2; Предмет=%3", Триггер, Строка(СсылкАгент), Строка(Предмет)),
		"Информация", RunId, Предмет);

	СобытиеЗахвата = Новый Структура;
	СобытиеЗахвата.Вставить("subject", Строка(Предмет));
	СобытиеЗахвата.Вставить("trigger", Триггер);
	ar_AuditСобытия.Зафиксировать(RunId, "ЗахватВзят", СобытиеЗахвата);

	Возврат Истина;

КонецФункции

// Активен ли захват, держащий запуск RunId: запуск жив (статус не финальный)
// или ожидает автоповтора. Записи запуска нет - захват считать неактивным
// (сиротский, его снимет уборка тика).
//
Функция ЗахватАктивен(Знач RunId)

	Состояние = СостояниеЗапуска(RunId);
	Если Состояние = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Не ЭтоФинальныйСтатус(Состояние.Статус) ИЛИ ОжиданиеАвтоповтора(Состояние);

КонецФункции

// Активный захват предмета соседом по очереди: другой агент с тем же
// ar_ПакетИсточник держит предмет живым запуском.
//
// Возвращаемое значение:
//  Строка - RunId активного запуска-соседа; "" если соседа нет.
//
Функция ЗахватСоседаПоОчереди(Знач Предмет, Знач СсылкАгент, Знач ПакетИсточник)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Захваты.ar_Запуск КАК RunId
		|ИЗ
		|	РегистрСведений.ar_ПредметыАгентов КАК Захваты
		|ГДЕ
		|	Захваты.ar_Предмет = &Предмет
		|	И Захваты.ar_Агент <> &Агент
		|	И Захваты.ar_ПакетИсточник = &Пакет
		|	И Захваты.ar_Запуск <> """"
		|	И НЕ Захваты.ar_Исключён";
	Запрос.УстановитьПараметр("Предмет", Предмет);
	Запрос.УстановитьПараметр("Агент", СсылкАгент);
	Запрос.УстановитьПараметр("Пакет", ПакетИсточник);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗахватАктивен(СокрЛП(Выборка.RunId)) Тогда
			Возврат СокрЛП(Выборка.RunId);
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Запись захвата по RunId.
//
// Возвращаемое значение:
//  Структура {Агент, Предмет} или Неопределено, если записи с таким RunId нет.
//
Функция ЗаписьЗахватаПоЗапуску(Знач RunId)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Захваты.ar_Агент КАК Агент,
		|	Захваты.ar_Предмет КАК Предмет
		|ИЗ
		|	РегистрСведений.ar_ПредметыАгентов КАК Захваты
		|ГДЕ
		|	Захваты.ar_Запуск = &RunId";
	Запрос.УстановитьПараметр("RunId", RunId);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Агент, Предмет", Выборка.Агент, Выборка.Предмет);

КонецФункции

// Состояние записи запуска: {Статус, ПовторитьПосле} или Неопределено, если
// записи ar_Запуски с таким RunId нет.
//
Функция СостояниеЗапуска(Знач RunId)

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_ИдентификаторЗапуска = RunId;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Статус, ПовторитьПосле",
		МенеджерЗаписи.ar_Статус, МенеджерЗаписи.ar_ПовторитьПосле);

КонецФункции

// Состояния нескольких запусков одним запросом (для уборки).
//
// Параметры:
//  RunIdСписок - Массив из Строка.
//
// Возвращаемое значение:
//  Соответствие - "RunId -> {Статус, ПовторитьПосле}".
//
Функция СостоянияЗапусков(Знач RunIdСписок)

	Результат = Новый Соответствие;

	Если RunIdСписок.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId,
		|	Запуски.ar_Статус КАК Статус,
		|	Запуски.ar_ПовторитьПосле КАК ПовторитьПосле
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ИдентификаторЗапуска В (&RunIdСписок)";
	Запрос.УстановитьПараметр("RunIdСписок", RunIdСписок);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СокрЛП(Выборка.RunId),
			Новый Структура("Статус, ПовторитьПосле", Выборка.Статус, Выборка.ПовторитьПосле));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Навигационные ссылки агентов одним списком (без обращения через точку в
// цикле - ar_Утилиты.НавигационнаяСсылкаОбъекта по строке списка).
//
Функция НавигационныеСсылкиАгентов(Знач Агенты)

	Результат = Новый Массив;
	Для Каждого Агент Из Агенты Цикл
		Результат.Добавить(ar_Утилиты.НавигационнаяСсылкаОбъекта(Агент));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Массив RunId из строк кандидатов уборки.
//
Функция RunIdСписокКандидатов(Знач Кандидаты)

	Результат = Новый Массив;
	Для Каждого СтрокаКандидата Из Кандидаты Цикл
		Результат.Добавить(СтрокаКандидата.RunId);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Триггеры очереди: их захваты сериализуются по предмету между всеми
// агентами (спека п.3.2).
//
Функция ЭтоТриггерОчереди(Знач Триггер)

	Возврат Триггер = "queue" ИЛИ Триггер = "deadline_expired";

КонецФункции

// Ожидает ли запуск автоповтора: ОшибкаВыполнения с заполненным
// ar_ПовторитьПосле - будет возобновлён тем же RunId, захват держится.
//
Функция ОжиданиеАвтоповтора(Знач Состояние)

	Возврат Состояние.Статус = Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения
		И ЗначениеЗаполнено(Состояние.ПовторитьПосле);

КонецФункции

// Финальные статусы запуска (полный список - как
// ar_Планировщик.ТерминальныеСтатусыЗапуска; дублирован намеренно, чтобы не
// зацикливать модули ar_ПредметыАгентов -> ar_Планировщик ->
// ar_ДиспетчерОчереди).
//
Функция ЭтоФинальныйСтатус(Знач Статус)

	Если Статус = Перечисления.ar_СтатусЗапуска.Завершён
		Или Статус = Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения
		Или Статус = Перечисления.ar_СтатусЗапуска.Отменён
		Или Статус = Перечисления.ar_СтатусЗапуска.ДостигнутМаксимумШагов
		Или Статус = Перечисления.ar_СтатусЗапуска.ОтклонёнГлобально
		Или Статус = Перечисления.ar_СтатусЗапуска.Прерван
		Или Статус = Перечисления.ar_СтатусЗапуска.ОшибкаНесовместимоеСостояние Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

// Машиночитаемая причина снятия по статусу запуска (спека п.5); для
// отсутствующей записи запуска - "orphan".
//
Функция ПричинаПоСостоянию(Знач Состояние)

	Если Состояние = Неопределено Тогда
		Возврат "orphan";
	КонецЕсли;

	Если Состояние.Статус = Перечисления.ar_СтатусЗапуска.Завершён Тогда
		Возврат "completed";
	ИначеЕсли Состояние.Статус = Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения Тогда
		Возврат "failed";
	ИначеЕсли Состояние.Статус = Перечисления.ar_СтатусЗапуска.ОшибкаНесовместимоеСостояние Тогда
		Возврат "incompatible_state";
	ИначеЕсли Состояние.Статус = Перечисления.ar_СтатусЗапуска.ДостигнутМаксимумШагов Тогда
		Возврат "max_steps";
	ИначеЕсли Состояние.Статус = Перечисления.ar_СтатусЗапуска.ОтклонёнГлобально Тогда
		Возврат "rejected";
	ИначеЕсли Состояние.Статус = Перечисления.ar_СтатусЗапуска.Отменён Тогда
		Возврат "cancelled";
	КонецЕсли;

	Возврат "interrupted";

КонецФункции

// Считается ли сбой при снятии: ошибка (без автоповтора - он отфильтрован
// раньше), несовместимое состояние и зависание; завершение сбрасывает
// счётчик; прочие причины счётчик не меняют (спека п.5).
//
Функция СбойУчитывается(Знач Состояние, Знач Причина)

	Если Причина = "heartbeat_timeout" Тогда
		Возврат Истина;
	КонецЕсли;

	Если Состояние = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Состояние.Статус = Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения
		Или Состояние.Статус = Перечисления.ar_СтатусЗапуска.ОшибкаНесовместимоеСостояние;

КонецФункции

// Порог сбоев подряд, после которого предмет исключается из выдачи очереди
// (спека п.5). Вынесен в функцию для единой точки изменения.
//
Функция ПорогСбоев()

	Возврат 3;

КонецФункции

// Окно уборки сиротских захватов в секундах (спека п.5: 5 минут - запас на
// разрыв между захватом и созданием записи запуска).
//
Функция ОкноУборкиСек()

	Возврат 5 * 60;

КонецФункции

// Потолок параллельных запусков: реквизит агента (0/пусто - 1), но не выше
// константы SCHED-05 (спека п.3.1).
//
Функция ЛимитПараллельных(Знач РеквизитАгента)

	Лимит = ?(ТипЗнч(РеквизитАгента) = Тип("Число") И РеквизитАгента > 0, РеквизитАгента, 1);
	Потолок = ar_Константы.МаксОдновременныхЗапусковАгента();
	Возврат ?(ТипЗнч(Потолок) = Тип("Число") И Потолок > 0, МИН(Лимит, Потолок), Лимит);

КонецФункции

// Источник записей журнала этого модуля.
//
Функция ИмяМодуляЛога()

	Возврат "ar_ПредметыАгентов";

КонецФункции

// Источник записей журнала диспетчера очереди (последние тики queue_tick
// ищутся в консоли по нему же).
//
Функция ИмяИсточникаДиспетчера()

	Возврат "ar_ДиспетчерОчереди";

КонецФункции

#КонецОбласти
